Description: Detects DNS requests on ports other than 53, 137, 5353, or 5355 to public IP addresses, which may indicate DNS tunneling or covert C2 activity.
severity: High

 tactic: Command and Control
       : Exfiltration
technique: T1071.004 # Application Layer Protocol: DNS
         : T1048 # Exfiltration Over Alternative Protocol
         : T1090 # Proxy
Query: |
  DeviceNetworkEvents
  | where ActionType == "NetworkSignatureInspected"
  | extend AF = parse_json(AdditionalFields)
  | extend NetworkSignature = AF.SignatureName
  //Search for network signatures that are DNS but not on regular DNS ports including Netbios & LLMNR if those are in use
  | where NetworkSignature == "DNS_Request" and RemotePort !in ("53", "137", "5353", "5355")
  //Exclude traffic where the remote IP is a private/local IP address
  | where not(ipv4_is_private(RemoteIP))
  | project
      TimeGenerated,
      DeviceName,
      NetworkSignature,
      LocalIP,
      LocalPort,
      RemoteIP,
      RemotePort,
      RemoteUrl
